# Отчёт по лабораторной работе №9 по курсу «Фундаментальная информатика»

<b>Студент группы:</b> <ins>М8О-108Б-22 Караев Тариел Жоомартбекович, № по списку 13</ins>

<b>Контакты e-mail:</b> <ins>idl76h@gmail.com</ins>

<b>Работа выполнена:</b> <ins>«12» ноября 2022 г.</ins>

<b>Преподаватель:</b> <ins>асп. каф. 806 Сахарин Никита Александрович</ins>

<b>Выходной контроль знаний с оценкой:</b> <ins>5 (отлично)</ins>

<b>Отчёт сдан</b> «12» <ins>ноября</ins> <ins>2022</ins> г., <b>итоговая оценка</b> <ins>5 (отлично)</ins>

<b>Подпись преподавателя:</b> ________________


## 1. Тема:  
Системы программирования на языке Си.

## 2. Цель работы:  
Составление и отладка простейшей программы на языке Си итеративного характера с целочисленными рекуррентными соотношениями, задающими регулярное движение точки в целочисленной системе координат с дискретным временем и динамическим параметром.

## 3. Задание:  
Написание программы для вычисления координат движения точки и проверки условия попадания в заданную геометрическую фигуру. 

## 4. Оборудование:
<b>Процессор:</b> 11th Gen Intel(R) Core(TM) i3-1115G4 @ 3.00GHz<br/>
<b>ОП:</b> 8 ГБ <br/>
<b>SSD:</b> 256 ГБ<br/>

## 5. Программное обеспечение:
<b>Операционная система семейства:</b> Windows 11 10.0.22000 <br/>
<b>Интерпретатор команд:</b> Powershell 5.1.22000.832 <br/>
<b>Система программирования:</b> gcc.exe (GCC) 10.3.0 <br/>
<b>Текстовый редактор:</b> Visual Studio Code версия 1.73.1 <br/>
<b>Местонахождение и имена файлов программ и данных на домашнем компьютере:</b> C:\Users\idl76> <br/>

## 6. Идея, метод, алгоритм решения задачи (в формах: словесной, псевдокода, графической [блок-схема, диаграмма, рисунок, таблица] или формальные спецификации с пред- и постусловиями)
Необходимо написать цикл для вычисления значений координат точки с течением времени. На каждой итерации цикла требуется проверка на попаданиие в заданную фигуру. 

## 7. Сценарий выполнения работы [план работы, первоначальный текст программы в черновике (можно на отдельном листе) и тесты либо соображения по тестированию]. 
- Просмотреть демонстрационный материал в лабораторной аудитории
- Написать программу:
~~~c
#include <stdio.h>

int sign(int n) {
	return n > 0 ? 1 : n < 0 ? -1 : 0;
}

int max(int a, int b) {
	return a > b ? a : b;
}

int min(int a, int b) {
	return a > b ? b : a;
}

int abs(int a) {
	return a >= 0 ? a : -a;
}

int main(void) {
	int i, j, l, k;
	i = 20;
	j = 10;
	l = -1;
	for (k = 0; k < 51; k += 1) {
		printf("k = %d, i = %d, j = %d, l = %d \n", k, i, j, l);
		if ((abs(i - 10) <= 5) && (abs(j + 10) < 5)) {
			printf("Hit! k = %d, i = %d, j = %d, l = %d \n", k, i, j, l);
			break;
		}
		if (k == 50) {
			printf("Missing! i = %d, j = %d, l = %d \n", i, j, l);
		}

		i = (abs(max(i*(k + 5), j*(k + 6))) - abs(min(j*(k + 7), l*(k + 8)))) % 20;
		j = (3 - sign(i - j)) * abs(min(i*l + 5, j*l - 3*i*j + 6)) % 25 - 7;
		l = i % 10  + j % 10 + l % 10;
	}
   return 0;
}
~~~

Пункты 1-7 отчета составляются сторого до начала лабораторной работы.
Допущен к выполнению работы.  
<b>Подпись преподавателя</b> ________________

## 8. Распечатка протокола.
~~~powershell
PS C:\Users\idl76\Desktop\VS> gcc -Wall -pedantic -std=c99 lab9.c -o lab9.exe
PS C:\Users\idl76\Desktop\VS> ./lab9.exe
Hit! k = 4, i = -9, j = 13, l = 9
~~~

## 9. Дневник отладки должен содержать дату и время сеансов отладки и основные события (ошибки в сценарии и программе, нестандартные ситуации) и краткие комментарии к ним. В дневнике отладки приводятся сведения об использовании других ЭВМ, существенном участии преподавателя и других лиц в написании и отладке программы.

| № |  Лаб. или дом. | Дата | Время | Событие | Действие по исправлению | Примечание |
| ------ | ------ | ------ | ------ | ------ | ------ | ------ |
| 1 | дом. | 12.11.22 | 13:00 | Выполнение лабораторной работы | - | - |

## 10. Замечания автора по существу работы.
Дополнительное задание:  
Усовершенствовать код при помощи структур `struct`.
##### Программа:
~~~c
#include <stdio.h>

int sign(int n) {
	return n > 0 ? 1 : n < 0 ? -1 : 0;
}

int max(int a, int b) {
	return a > b ? a : b;
}

int min(int a, int b) {
	return a > b ? b : a;
}

int abs(int a) {
	return a >= 0 ? a : -a;
}

typedef struct {
    int i;
    int j;
    int l;
} Point;

typedef struct {
    int a;
    int i;
    int j;
} Square;

int is_in_square(Square square, Point point) {
    return (abs(point.i + square.i) <= (square.a / 2)) && (abs(point.j + square.j) <= (square.a / 2));
}

Point move(Point prev, int k) {
    Point next;
    next.i = (abs(max(prev.i*(k + 5), prev.j*(k + 6))) - abs(min(prev.j*(k + 7), prev.l*(k + 8)))) % 20;
    next.j = (3 - sign(prev.i - prev.j)) * abs(min(prev.i*prev.l + 5, prev.j*prev.l - 3*prev.i*prev.j + 6)) % 25 - 7;
    next.l = prev.i % 10 + prev.j % 10 + prev.l % 10;
    return next;
}

int main(void) {
    Point point = {20, 10, -1};
    Square square = {10, 10, -10};
    for (int k = 0; k < 51; ++k) {
        printf("k = %d, i = %d, j = %d, l = %d \n", k, point.i, point.j, point.l);
        if (is_in_square(square, point)) {
            printf("Hit! k = %d, i = %d, j = %d, l = %d \n", k, point.i, point.j, point.l);
            break;
        }
        if (k == 50) {
            printf("Missing! i = %d, j = %d, l = %d \n", point.i, point.j, point.l);
        }
        point = move(point, k);
    }
    return 0;
}
~~~

##### Распечатка протокола.
~~~powershell
PS C:\Users\idl76\Desktop\VS> gcc -Wall -pedantic -std=c99 lab9+.c -o lab9+.exe
PS C:\Users\idl76\Desktop\VS> ./lab9+.exe
Hit! k = 4, i = -9, j = 13, l = 9
~~~

## 11. Выводы
Была составлена и отлажена простейшая программа на языке Си итеративного характера. В ходе выполнения заданий были изучены основы написания более читаемого кода, вклюая использование структур `struct`.

Недочёты при выполнении задания могут быть устранены следующим образом: —

<b>Подпись студента:</b> ________________