# Отчёт по лабораторной работе №8 по курсу «Фундаментальная информатика»

<b>Студент группы:</b> <ins>М8О-108Б-22 Караев Тариел Жоомартбекович, № по списку 13</ins>

<b>Контакты e-mail:</b> <ins>idl76h@gmail.com</ins>

<b>Работа выполнена:</b> <ins>«29» октября 2022 г.</ins>

<b>Преподаватель:</b> <ins>асп. каф. 806 Сахарин Никита Александрович</ins>

<b>Выходной контроль знаний с оценкой:</b> <ins>5 (отлично)</ins>

<b>Отчёт сдан</b> «29» <ins>октября</ins> <ins>2022</ins> г., <b>итоговая оценка</b> <ins>5 (отлично)</ins>

<b>Подпись преподавателя:</b> ________________


## 1. Тема:  
Системы программирования на языке Си.

## 2. Цель работы:  
Изучение конкретной системы программирования на Си и получение навыков подготовки текстов и отладки программ.

## 3. Задание:  
- Изучение и освоение возможности лабораторной СП по содержащейся в практике документации и другим источникам, в том числе основные этапы процесса компиляции и подготовки программ к выполнению.
- Составление и отладка простейшей программы на Си в терминальном классе.
- Изучение различных систем программирования на Си на других плотформах: GNU, MS Visual Studio и др. на домашних компьютерах.

## 4. Оборудование:
<b>Процессор:</b> 11th Gen Intel(R) Core(TM) i3-1115G4 @ 3.00GHz<br/>
<b>ОП:</b> 8 ГБ <br/>
<b>SSD:</b> 256 ГБ<br/>

## 5. Программное обеспечение:
<b>Операционная система семейства:</b> Windows 11 10.0.22000 <br/>
<b>Интерпретатор команд:</b> Powershell 5.1.22000.832 <br/>
<b>Система программирования:</b> gcc.exe (GCC) 10.3.0 <br/>
<b>Текстовый редактор:</b> Visual Studio Code версия 1.73.1 <br/>
<b>Местонахождение и имена файлов программ и данных на домашнем компьютере:</b> C:\Users\idl76> <br/>

## 6. Идея, метод, алгоритм решения задачи (в формах: словесной, псевдокода, графической [блок-схема, диаграмма, рисунок, таблица] или формальные спецификации с пред- и постусловиями)
Необходимо написать, скомпилировать и запустить программу, выводящую строку "Hello, World!".

## 7. Сценарий выполнения работы [план работы, первоначальный текст программы в черновике (можно на отдельном листе) и тесты либо соображения по тестированию]. 
- Просмотреть демонстрационный материал в лабораторной аудитории
- Написать программу:
~~~c
#include <stdio.h>

int main(void) {
    printf("Hello, World!");
    return 0;
}
~~~

Пункты 1-7 отчета составляются сторого до начала лабораторной работы.
Допущен к выполнению работы.  
<b>Подпись преподавателя</b> ________________

## 8. Распечатка протокола.
~~~powershell
PS C:\Users\idl76\Desktop\VS> gcc -Wall -pedantic -std=c99 lab6.c -o lab6.exe
PS C:\Users\idl76\Desktop\VS> ./lab6.exe
Hello, World!
~~~

## 9. Дневник отладки должен содержать дату и время сеансов отладки и основные события (ошибки в сценарии и программе, нестандартные ситуации) и краткие комментарии к ним. В дневнике отладки приводятся сведения об использовании других ЭВМ, существенном участии преподавателя и других лиц в написании и отладке программы.

| № |  Лаб. или дом. | Дата | Время | Событие | Действие по исправлению | Примечание |
| ------ | ------ | ------ | ------ | ------ | ------ | ------ |
| 1 | дом. | 29.10.22 | 13:00 | Выполнение лабораторной работы | - | - |

## 10. Замечания автора по существу работы.
Дополнительное задание:  
На вход подаётся строка, означающая двадцатишестеричную систему счисления с алфавитом из заглавных латинских букв. Вывести числовое значение.

### Программа:
~~~c
#include <stdio.h>
#include <string.h>

int transform(char str[]) {
    int total = 0, len = strlen(str);
    for (int i = 0; i < len; ++i) {
        total *= 26;
        total += (str[i] - 'A' + 1);
    }
    return total;
}

int main(void) {
    char str[10];
    scanf("%s", str);
    printf("%d\n", transform(str));
    return 0;
}
~~~

##### Тесты.
- AA
- A1
- ABB8

##### Распечатка протокола.
~~~powershell
PS C:\Users\idl76\Рабочий стол\fundamental-computer-science-sempaitakoo\workshop> gcc -Wall -pedantic -std=c99 lab8+.c -o lab8+.exe
PS C:\Users\idl76\Рабочий стол\fundamental-computer-science-sempaitakoo\workshop> ./lab8+.exe
AA
27
PS C:\Users\idl76\Рабочий стол\fundamental-computer-science-sempaitakoo\workshop> ./lab8+.exe
A1
11
PS C:\Users\idl76\Рабочий стол\fundamental-computer-science-sempaitakoo\workshop> ./lab8+.exe
ABB8
18972
~~~

## 11. Выводы
Были изучены основы системы программирования на Си и получены навыки подготовки текстов и отладки программ. В ходе выполнения работы были освоены базовые принципы оформления кода, а также оптимизации алгоритмов.

Недочёты при выполнении задания могут быть устранены следующим образом: —

<b>Подпись студента:</b> ________________